In [100]:
#conexão com banco de dados sqlite3

import sqlite3
import pandas as pd

cnx = sqlite3.connect('/home/silvio/survey.db')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
id          5 non-null object
personal    5 non-null object
family      5 non-null object
dtypes: object(3)
memory usage: 248.0+ bytes
         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [101]:
dfPerson = pd.read_sql_query("SELECT * FROM person", cnx)
dfPerson.info()
dfPerson.describe()
print(dfPerson)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
id          5 non-null object
personal    5 non-null object
family      5 non-null object
dtypes: object(3)
memory usage: 248.0+ bytes
         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [52]:
dfsite = pd.read_sql_query("SELECT * FROM Site", cnx)
print(dfsite.describe())
print(dfsite)

             lat        long
count   4.000000    4.000000
mean  -36.217500  -94.172500
std    24.836751   64.150667
min   -49.850000 -128.570000
25%   -49.115000 -127.182500
50%   -48.010000 -125.060000
75%   -35.112500  -92.050000
max     1.000000    2.000000
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
3    DD1   1.00    2.00

In [109]:
dfvisited=pd.read_sql_query("SELECT max(id) FROM Visited;", cnx)
print(dfvisited)

dfvisited=pd.read_sql_query("SELECT * FROM Visited;", cnx)
print(dfvisited['id'].max())

   max(id)
0      999
999

In [91]:
# Selecionando colunas

dfPerson = pd.read_sql_query("SELECT family, personal FROM Person;", cnx)
print(dfPerson)
dfSurvey = pd.read_sql_query("SELECT * FROM Survey;", cnx)
print(dfSurvey)
print(dfPerson['family'])

     family   personal
0      Dyer    William
1   Pabodie      Frank
2      Lake   Anderson
3   Roerich  Valentina
4  Danforth      Frank
    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735   None   sal     0.06
9     735   None  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25
0        Dyer
1     Pabodie
2        Lake
3     Roerich
4    Danforth
Name: family, dtype: object

In [72]:
dfSurvey = pd.read_sql_query("SELECT quant FROM Survey", cnx)
print(dfSurvey)

   quant
0    rad
1    sal
2    rad
3    sal
4    rad
5    sal
6   temp
7    rad
8    sal
9   temp
10   rad
11  temp
12   sal
13   rad
14   sal
15  temp
16   sal
17   rad
18   sal
19   sal
20   rad

In [93]:
#distinct - opção para remover registros com valores repetidos de uma coluna específica
dfSurvey = pd.read_sql_query("SELECT DISTINCT quant FROM Survey;", cnx)
print(dfSurvey)

dfSurvey = pd.read_sql_query("SELECT * FROM Survey;", cnx)
print(dfSurvey['quant'])
print(dfSurvey['quant'].unique())

  quant
0   rad
1   sal
2  temp
0      rad
1      sal
2      rad
3      sal
4      rad
5      sal
6     temp
7      rad
8      sal
9     temp
10     rad
11    temp
12     sal
13     rad
14     sal
15    temp
16     sal
17     rad
18     sal
19     sal
20     rad
Name: quant, dtype: object
['rad' 'sal' 'temp']

In [74]:
dfSurvey = pd.read_sql_query("SELECT DISTINCT taken, quant FROM Survey;", cnx)
print(dfSurvey)

    taken quant
0     619   rad
1     619   sal
2     622   rad
3     622   sal
4     734   rad
5     734   sal
6     734  temp
7     735   rad
8     735   sal
9     735  temp
10    751   rad
11    751  temp
12    751   sal
13    752   rad
14    752   sal
15    752  temp
16    837   rad
17    837   sal
18    844   rad

In [83]:
#ordenando
dfPerson = pd.read_sql_query("SELECT * FROM person ORDER BY id  ASC;", cnx)
print(dfPerson)

         id   personal    family
0  danforth      Frank  Danforth
1      dyer    William      Dyer
2      lake   Anderson      Lake
3        pb      Frank   Pabodie
4       roe  Valentina   Roerich

In [89]:
#ordenando com Pandas
dfPerson = pd.read_sql_query("SELECT * FROM person", cnx)
print(dfPerson)
print(dfPerson.sort_values(by=['id']))

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth
         id   personal    family
4  danforth      Frank  Danforth
0      dyer    William      Dyer
2      lake   Anderson      Lake
1        pb      Frank   Pabodie
3       roe  Valentina   Roerich

In [79]:
#Filtro por linhas

dfSite = pd.read_sql_query("SELECT * FROM Visited WHERE site = 'DR-1';", cnx)
print(dfSite)

dfSite = pd.read_sql_query("SELECT * FROM Visited WHERE site = 'DR-1' AND dated < '1930-01-01';", cnx)
print(dfSite)

dfSurvey= pd.read_sql_query("SELECT * FROM Survey WHERE person IN ('lake', 'roe');", cnx)
print(dfSurvey)

    id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10
2  844  DR-1  1932-03-22
    id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10
   taken person quant  reading
0    734   lake   sal     0.05
1    751   lake   sal     0.10
2    752   lake   rad     2.19
3    752   lake   sal     0.09
4    752   lake  temp   -16.00
5    752    roe   sal    41.60
6    837   lake   rad     1.46
7    837   lake   sal     0.21
8    837    roe   sal    22.50
9    844    roe   rad    11.25

               id
count    4.000000
mean   797.250000
std    161.303802
min    619.000000
25%    705.250000
50%    785.500000
75%    877.500000
max    999.000000
    id   site       dated
0  999   DDF3
1  619   DR-1  1927-02-08
2  734   DR-3  1930-01-07
3  837  MSK-4  1932-01-14

               id
count    9.000000
mean   765.888889
std    117.348247
min    619.000000
25%    734.000000
50%    751.000000
75%    837.000000
max    999.000000
    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22
8  999   DDF3
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f7e306b4710>
site  DDF3  dated      id  site dated
8  999  DDF3
site  DR-1  dated      id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10
7  844  DR-1  1932-03-22
site  DR-3  dated      id  site       dated
2  734  DR-3  1930-01-07
3  735  DR-3  1930-01-12
4  751  DR-3  1930-02-26
5  752  DR-3        None
site  MSK-4  dated      id   site       dated
6  837  MSK-4  1932-01-14
       id  dated
site
DDF3    1      1
DR-1    3      3
DR-3    4      3
MSK-4   1      1
site  id
site  dated
            id  site
dated
             1     1
1927-02-08   1     1
1927-02-10   1     1
1930-01-07   1     1
1930-01-12   1     1
1930-02-26   1     1
1932-01-14   1     1
1932-03-22   1     1
dated  id
dated  site

In [53]:
#Exemplos com merge
dfVisitedSiteMerged = pd.read_sql_query("SELECT * FROM Site s INNER JOIN Visited v ON s.name = v.site", cnx)
print(dfVisitedSiteMerged)

dfVisitedSiteMerged = pd.read_sql_query("SELECT * FROM Site s LEFT JOIN Visited v ON s.name = v.site", cnx)
print(dfVisitedSiteMerged)

    name    lat    long   id   site       dated
0   DR-1 -49.85 -128.57  619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57  622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57  844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72  734   DR-3  1930-01-07
4   DR-3 -47.15 -126.72  735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72  751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72  752   DR-3        None
7  MSK-4 -48.87 -123.40  837  MSK-4  1932-01-14
    name    lat    long     id   site       dated
0   DR-1 -49.85 -128.57  619.0   DR-1  1927-02-08
1   DR-1 -49.85 -128.57  622.0   DR-1  1927-02-10
2   DR-1 -49.85 -128.57  844.0   DR-1  1932-03-22
3   DR-3 -47.15 -126.72  734.0   DR-3  1930-01-07
4   DR-3 -47.15 -126.72  735.0   DR-3  1930-01-12
5   DR-3 -47.15 -126.72  751.0   DR-3  1930-02-26
6   DR-3 -47.15 -126.72  752.0   DR-3        None
7  MSK-4 -48.87 -123.40  837.0  MSK-4  1932-01-14
8    DD1   1.00    2.00    NaN   None        None

In [59]:
#dfMerge = pd.merge(dfsite, dfVisited)
#print(dfMerge)

dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site')
print(dfMerge)

dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site').drop('site', axis=1)
print(dfMerge)

    name    lat    long   id   site       dated
0   DR-1 -49.85 -128.57  619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57  622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57  844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72  734   DR-3  1930-01-07
4   DR-3 -47.15 -126.72  735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72  751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72  752   DR-3        None
7  MSK-4 -48.87 -123.40  837  MSK-4  1932-01-14
    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14
    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14
    name    lat    long     id       dated
0   DR-1 -49.85 -128.57  619.0  1927-02-08
1   DR-1 -49.85 -128.57  622.0  1927-02-10
2   DR-1 -49.85 -128.57  844.0  1932-03-22
3   DR-3 -47.15 -126.72  734.0  1930-01-07
4   DR-3 -47.15 -126.72  735.0  1930-01-12
5   DR-3 -47.15 -126.72  751.0  1930-02-26
6   DR-3 -47.15 -126.72  752.0        None
7  MSK-4 -48.87 -123.40  837.0  1932-01-14
8    DD1   1.00    2.00    NaN         NaN
9    NaN    NaN     NaN  999.0
    name    lat    long     id       dated
0   DR-1 -49.85 -128.57  619.0  1927-02-08
1   DR-1 -49.85 -128.57  622.0  1927-02-10
2   DR-1 -49.85 -128.57  844.0  1932-03-22
3   DR-3 -47.15 -126.72  734.0  1930-01-07
4   DR-3 -47.15 -126.72  735.0  1930-01-12
5   DR-3 -47.15 -126.72  751.0  1930-02-26
6   DR-3 -47.15 -126.72  752.0        None
7  MSK-4 -48.87 -123.40  837.0  1932-01-14
8    DD1   1.00    2.00    NaN         NaN
    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14
8    NaN    NaN     NaN  999

In [60]:
dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site', how='inner').drop('site', axis=1)
print(dfMerge)

dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site', how='outer').drop('site', axis=1)
print(dfMerge)

dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site', how='left').drop('site', axis=1)
print(dfMerge)

dfMerge = pd.merge(dfsite, dfVisited, left_on='name',right_on='site', how='right').drop('site', axis=1)
print(dfMerge)

    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14
    name    lat    long     id       dated
0   DR-1 -49.85 -128.57  619.0  1927-02-08
1   DR-1 -49.85 -128.57  622.0  1927-02-10
2   DR-1 -49.85 -128.57  844.0  1932-03-22
3   DR-3 -47.15 -126.72  734.0  1930-01-07
4   DR-3 -47.15 -126.72  735.0  1930-01-12
5   DR-3 -47.15 -126.72  751.0  1930-02-26
6   DR-3 -47.15 -126.72  752.0        None
7  MSK-4 -48.87 -123.40  837.0  1932-01-14
8    DD1   1.00    2.00    NaN         NaN
9    NaN    NaN     NaN  999.0
    name    lat    long     id       dated
0   DR-1 -49.85 -128.57  619.0  1927-02-08
1   DR-1 -49.85 -128.57  622.0  1927-02-10
2   DR-1 -49.85 -128.57  844.0  1932-03-22
3   DR-3 -47.15 -126.72  734.0  1930-01-07
4   DR-3 -47.15 -126.72  735.0  1930-01-12
5   DR-3 -47.15 -126.72  751.0  1930-02-26
6   DR-3 -47.15 -126.72  752.0        None
7  MSK-4 -48.87 -123.40  837.0  1932-01-14
8    DD1   1.00    2.00    NaN         NaN
    name    lat    long   id       dated
0   DR-1 -49.85 -128.57  619  1927-02-08
1   DR-1 -49.85 -128.57  622  1927-02-10
2   DR-1 -49.85 -128.57  844  1932-03-22
3   DR-3 -47.15 -126.72  734  1930-01-07
4   DR-3 -47.15 -126.72  735  1930-01-12
5   DR-3 -47.15 -126.72  751  1930-02-26
6   DR-3 -47.15 -126.72  752        None
7  MSK-4 -48.87 -123.40  837  1932-01-14
8    NaN    NaN     NaN  999

In [116]:
dfsurvey = pd.read_sql_query("SELECT   person, count(reading), round(avg(reading), 2) FROM  Survey GROUP BY person;",cnx)
print(dfsurvey)

  person  count(reading)  round(avg(reading), 2)
0   None               2                  -12.97
1   dyer               4                    4.46
2   lake               7                   -1.70
3     pb               5                   -4.00
4    roe               3                   25.12

In [150]:
dfsurvey = pd.read_sql_query("SELECT   * FROM  Survey",cnx)
print(dfsurvey)    

gby=dfsurvey.groupby('person').count()
print(gby)

    
gby=dfsurvey.groupby('person')['reading'].mean()

for (g) in gby:
    print("reading mean ",g)

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735   None   sal     0.06
9     735   None  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25
        taken  quant  reading
person
dyer        4      4        4
lake        7      7        7
pb          5      5        5
roe         3      3        3
reading mean  4.46
reading mean  -1.6999999999999997
reading mean  -4.004
reading mean  25.116666666666664

In [118]:
#agrupando

dfVisited = pd.read_sql_query("SELECT * FROM Visited", cnx)
print(dfVisited.describe())
print(dfVisited)

gby=dfVisited.groupby('site')
print(gby)

for (site, dated) in gby:
    print("site ",site," dated ",dated)
    
gby=dfVisited.groupby('site').count()
print(gby)

for (site) in gby:
    print("site ",site)
    
gby=dfVisited.groupby('dated').count()
print(gby)

for (dated) in gby:
    print("dated ",dated)

               id
count    9.000000
mean   765.888889
std    117.348247
min    619.000000
25%    734.000000
50%    751.000000
75%    837.000000
max    999.000000
    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22
8  999   DDF3
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f7e3043f5c0>
site  DDF3  dated      id  site dated
8  999  DDF3
site  DR-1  dated      id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10
7  844  DR-1  1932-03-22
site  DR-3  dated      id  site       dated
2  734  DR-3  1930-01-07
3  735  DR-3  1930-01-12
4  751  DR-3  1930-02-26
5  752  DR-3        None
site  MSK-4  dated      id   site       dated
6  837  MSK-4  1932-01-14
       id  dated
site
DDF3    1      1
DR-1    3      3
DR-3    4      3
MSK-4   1      1
site  id
site  dated
            id  site
dated
             1     1
1927-02-08   1     1
1927-02-10   1     1
1930-01-07   1     1
1930-01-12   1     1
1930-02-26   1     1
1932-01-14   1     1
1932-03-22   1     1
dated  id
dated  site